app/views/analytics/index.html.erb

<h3>Number of Goals Done</h3>
<%= Goal.completed_goals.count%>
---
SELECT "goals".* FROM "goals"
SELECT COUNT(*) FROM "goals"