app/views/users/show.html.erb

<h3>Goals</h3>
<% @user.goals.each do |goal| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 5]]

<h3>Habits</h3>
<% @user.habits.each do |habit| %>
---
SELECT "habits".* FROM "habits" INNER JOIN "goals" ON "habits"."goal_id" = "goals"."id" WHERE "goals"."user_id" = ?  [["user_id", 5]]

<h3>Comments</h3>
<% @user.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 5]]