app/controllers/categories_controller.rb

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Test"], ["created_at", "2020-05-28 08:43:50.098254"], ["updated_at", "2020-05-28 08:43:50.098254"]]
INSERT INTO "journals" ("entry", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["entry", "You created the testing category"], ["user_id", 16], ["created_at", "2020-05-28 08:52:20.735947"], ["updated_at", "2020-05-28 08:52:20.735947"]]
---
    def create
        @category = Category.new(category_params)
        if @category.save
            redirect_to @category
            @new_journal = Journal.create(entry: "You created the #{@category.title} category", user_id: session[:user_id])

UPDATE "categories" SET "title" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["title", "Lifestyle"], ["updated_at", "2020-05-26 20:44:47.091901"], ["id", 5]]
---
    def update
        @category.update(category_params)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def current_category
        @category = Category.find(params[:id])