app/controllers/comments_controller.rb

SELECT "goals".* FROM "goals"
---
    def new
        @comment = Comment.new
        @goals = Goal.all

INSERT INTO "comments" ("content", "goal_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "I like to test things too"], ["goal_id", 6], ["user_id", 5], ["created_at", "2020-05-26 21:05:53.592408"], ["updated_at", "2020-05-26 21:05:53.592408"]]
---
    def create
        @comment = Comment.create(comment_params.merge(user_id: session[:user_id]))

SELECT "goals".* FROM "goals"
---
    def edit
        @goals = Goal.all

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "I like to test things as well"], ["updated_at", "2020-05-26 21:32:13.941295"], ["id", 5]]
---
    def update
        @comment.update(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def current_comment
        @comment = Comment.find(params[:id])