app/controllers/goals_controller.rb

    def index
        @goals = Goal.all
---
SELECT "goals".* FROM "goals"

    def create
        @goal = Goal.new(goal_params.merge(user_id: @user.id))
        if !params[:goal]["{:category=>:id}"].blank?
            new_category = Category.create(title: params[:goal]["{:category=>:id}"])
            @goal.category_id = new_category.id
            @new_journal = Journal.create(entry: "You created the #{new_category.title} category", user_id: session[:user_id])
        end
        if @goal.save
---
INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "newnew"], ["created_at", "2020-05-27 15:03:31.626975"], ["updated_at", "2020-05-27 15:03:31.626975"]]
INSERT INTO "goals" ("title", "category_id", "description", "due_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        if !@goal.complete
            if @goal.user.id == @user.id
                @goal.update(goal_params)
---
UPDATE "goals" SET "cheers" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["cheers", 1], ["updated_at", "2020-05-28 04:06:29.305218"], ["id", 14]]

    def cheer
        @goal.add_cheer
        @goal.save
---
UPDATE "goals" SET "cheers" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["cheers", 1], ["updated_at", "2020-05-27 22:32:47.589550"], ["id", 9]]

    def complete_goal
        @goal = Goal.find(params[:goal_id])
        @goal.completed_it
        @goal.save
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "goals" SET "complete" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["complete", 1], ["updated_at", "2020-05-28 08:34:04.560453"], ["id", 14]]

    def current_goal
        @goal = Goal.find(params[:id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]