app/controllers/goals_controller.rb

UPDATE "goals" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["title", "Test"], ["description", "Test Description"], ["updated_at", "2020-05-26 20:14:54.490621"], ["id", 5]]
---
    def update
        @goal.update(goal_params)

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def current_goal
        @goal = Goal.find(params[:id])