app/controllers/habits_controller.rb

INSERT INTO "habits" ("name", "description", "goal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "hjkhjkh"], ["description", "hjkhjklkl"], ["goal_id", 13], ["created_at", "2020-05-28 08:33:47.323435"], ["updated_at", "2020-05-28 08:33:47.323435"]]
INSERT INTO "habits" ("name", "description", "goal_id", "complete", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test Habit"], ["description", "Test habit description"], ["goal_id", 6], ["complete", 0], ["created_at", "2020-05-26 20:31:23.305734"], ["updated_at", "2020-05-26 20:31:23.305734"]]
---
    def create
        @habit = Habit.create(habit_params)
        redirect_to @habit
        @new_journal = Journal.create(entry: "You created a #{@habit.name} habit", user_id: session[:user_id])

UPDATE "habits" SET "description" = ?, "updated_at" = ? WHERE "habits"."id" = ?  [["description", "Test habit description...blah..blah..blah"], ["updated_at", "2020-05-26 20:33:56.320808"], ["id", 9]]
---
    def update
        if !@habit.complete
            @habit.update(habit_params)

SELECT "habits".* FROM "habits" WHERE "habits"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
UPDATE "habits" SET "complete" = ?, "updated_at" = ? WHERE "habits"."id" = ?  [["complete", 1], ["updated_at", "2020-05-28 08:30:04.003934"], ["id", 33]]
UPDATE "goals" SET "complete" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["complete", 1], ["updated_at", "2020-05-28 05:53:21.043204"], ["id", 15]]
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "habits".* FROM "habits" WHERE "habits"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
---
    def complete_habit
        @habit = Habit.find(params[:habit_id])
        @habit.completed_it
        @habit.save
        @habit.completing_goal
        @habit.save
        @goal = Goal.find(@habit.goal.id)

SELECT "habits".* FROM "habits" WHERE "habits"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
---
    def current_habit
        @habit = Habit.find(params[:id])

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 16]]
---
    def all_progress_goals_for_user
        @g = Goal.where(user_id: session[:user_id])
        @goals = @g.select { |g| g.complete == false}