app/controllers/users_controller.rb

    def update
        if @user.update(user_params)
            redirect_to @user
            @new_journal = Journal.create(entry: "You updated your account", user_id: @user.id)
---
UPDATE "users" SET "name" = ?, "email" = ?, "image_url" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Test"], ["email", ""], ["image_url", ""], ["updated_at", "2020-05-27 03:49:45.575589"], ["id", 5]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    def create
        @user = User.new(auth_params)
        # byebug

        if @user.valid?
            @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    def show
        @completed = @user.sort_due_date.completed_goals
        @progress = @user.sort_due_date.goals_in_progress
        @hprogress = @user.habits_in_progress
        @featured = @user.most_likes
        @percentage = @user.goals_percentage_done
        if session[:user_id] == params[:id].to_i
            @user = User.find(session[:user_id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ? ORDER BY "goals"."due_date" ASC  [["user_id", 16]]
SELECT "habits".* FROM "habits" INNER JOIN "goals" ON "habits"."goal_id" = "goals"."id" WHERE "goals"."user_id" = ?  [["user_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

    def destroy
        session.delete(:user_id)
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 14]]