app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def current_user
        if session[:user_id]
            @user = User.find(session[:user_id])