app/views/goals/show.html.erb

<h3>Comments</h3>
    <% @goal.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."goal_id" = ?  [["goal_id", 12]]