app/views/goals/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."goal_id" = ?  [["goal_id", 2]]
---
<h3>Comments</h3>
    <% @goal.comments.each do |comment|%>