app/models/category.rb

SELECT "categories".* FROM "categories"
SELECT "goals".* FROM "goals" WHERE "goals"."category_id" = ?  [["category_id", 3]]
---
    def self.most_popular
        self.all.max_by(3) { |c|
            c.goals.length

SELECT "categories".* FROM "categories"
SELECT "goals".* FROM "goals" WHERE "goals"."category_id" = ?  [["category_id", 3]]
---
    def self.top
        self.all.max_by { |c|
            c.goals.length

SELECT "categories".* FROM "categories"
---
    def most_popular?(arr)
        arr.include?(self)