app/models/comment.rb

SELECT "comments".* FROM "comments"
---
    def self.newest
        self.all.sort {|a,b|

SELECT "comments".* FROM "comments"
---
    def self.longest
        self.all.max_by { |comment|