app/models/goal.rb

    def completed_it
        self.complete = true
        self.habits.each { |h|
---
SELECT "habits".* FROM "habits" WHERE "habits"."goal_id" = ?  [["goal_id", 13]]

    def habit_percentage_done
        perc = (self.completed_habits.count.to_f / self.habits.count.to_f) * 100
---
SELECT COUNT(*) FROM "habits" WHERE "habits"."goal_id" = ?  [["goal_id", 12]]

    def self.goal_percentage_done
        perc = (completed_goals.count.to_f / self.all.count.to_f) * 100
---
SELECT COUNT(*) FROM "goals"

    def habits_in_progress
        self.habits.select { |g|
---
SELECT "habits".* FROM "habits" WHERE "habits"."goal_id" = ?  [["goal_id", 12]]

    def completed_habits
        self.habits.select { |h|
---
SELECT "habits".* FROM "habits" WHERE "habits"."goal_id" = ?  [["goal_id", 14]]

    def self.completed_goals
        self.all.select { |g|
---
SELECT "goals".* FROM "goals"

    def checking_completion
        if self.habits.all? { |hab| hab.complete == true}
---
SELECT "habits".* FROM "habits" WHERE "habits"."goal_id" = ?  [["goal_id", 14]]

    def self.trending
        self.all.max_by(5) { |g|
---
SELECT "goals".* FROM "goals"

    def self.most_cheers
        self.all.max_by { |g|
---
SELECT "goals".* FROM "goals"

    def self.most_cheers_and_comments
        self.all.max_by { |g|
            g.cheers + g.comments.length
---
SELECT "goals".* FROM "goals"
SELECT "comments".* FROM "comments" WHERE "comments"."goal_id" = ?  [["goal_id", 3]]

    def self.top_comments
        self.all.max_by { |g|
            g.comments.length
---
SELECT "goals".* FROM "goals"
SELECT "comments".* FROM "comments" WHERE "comments"."goal_id" = ?  [["goal_id", 3]]

    def self.least_cheer
        self.all.min_by { |g|
---
SELECT "goals".* FROM "goals"

    def self.least_comments
        self.all.max_by { |g|
            g.comments.length
---
SELECT "goals".* FROM "goals"
SELECT "comments".* FROM "comments" WHERE "comments"."goal_id" = ?  [["goal_id", 3]]

    def self.total_habits
        Habit.all.count
---
SELECT COUNT(*) FROM "habits"

    def self.average_number_of_habits
        (total_habits.to_f/Goal.all.count).round(2)
---
SELECT COUNT(*) FROM "goals"

    def self.average_cheers
        (self.all.count / self.total_cheers).round(2)
---
SELECT COUNT(*) FROM "goals"

    def self.average_comments
        (self.all.count / self.total_comments).round(2)
---
SELECT COUNT(*) FROM "goals"

    def self.total_cheers
        total = 0
        Goal.all.each { |g|
---
SELECT "goals".* FROM "goals"

    def self.total_comments
        total = 0
        Goal.all.each { |g|
            total += g.comments.count
---
SELECT "goals".* FROM "goals"
SELECT COUNT(*) FROM "comments" WHERE "comments"."goal_id" = ?  [["goal_id", 3]]

    def self.all_due_soon
        due = self.all.select { |goal|
---
SELECT "goals".* FROM "goals"

    def self.all_past_due
        self.all.select { |goal|
            goal.past_due
        }.map do |g|
            g.title
        end.join(" , ")
---
SELECT "goals".* FROM "goals"

    def self.by_month(month)
        self.all.select { |goal|
            goal.created_at.strftime("%A, %B%e, %Y").include? month
        }.map do |g|
            g.title
        end.join(" , ")
---
SELECT "goals".* FROM "goals"

    def self.latest
        self.all.sort {|a,b|
---
SELECT "goals".* FROM "goals"