app/models/habit.rb

    def self.by_month(month)
        self.all.select { |habit|
---
SELECT "habits".* FROM "habits"