app/models/user.rb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 16]]
---
    def completed_goals
        self.goals.select { |g|

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 16]]
---
    def goals_in_progress
        self.goals.select { |g|

SELECT "habits".* FROM "habits" INNER JOIN "goals" ON "habits"."goal_id" = "goals"."id" WHERE "goals"."user_id" = ?  [["user_id", 16]]
---
    def habits_in_progress
        self.habits.select { |h|

SELECT COUNT(*) FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 16]]
---
    def goals_percentage_done
        perc = (self.completed_goals.count.to_f / self.goals.count.to_f) * 100

SELECT COUNT(*) FROM "goals"
---
    def self.total_goals
        Goal.all.count

SELECT COUNT(*) FROM "users"
---
    def self.average_number_of_goals
        (total_goals.to_f/User.count).round(2)

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 3]]
---
    def self.least_active
        self.all.min_by { |user|
            user.goals.count

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 3]]
---
    def self.most_active
        self.all.max_by { |user|
            user.goals.count