app/views/categories/show.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."category_id" = ?  [["category_id", 10]]
---
<h3>Goals:</h3>
<% @category.goals.each do |goal|%>